# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
net = input("Введите IP-адрес и маску сети в формате \"10.10.10.0/24\": ")
value = list((net.replace("."," ")).replace("/"," ").split())
mask = "1" * int(value[4]) + "0" * (32-int(value[4]))

template = """
    Network:
    {0:<10}{1:<10}{2:<10}{3:<10}
    {0:08b}  {1:08b}  {2:08b}  {3:08b}
    Mask:
    /{4:<3}
    {5:<10}{6:<10}{7:<10}{8:<10}
    {5:08b}  {6:08b}  {7:08b}  {8:08b}
"""

print(template.format(int(value[0]),int(value[1]),int(value[2]),int(value[3]),int(value[4]),int(mask[0:8],2),int(mask[8:16],2),
int(mask[16:24],2),int(mask[24:],2)))