# -*- coding: utf-8 -*-
"""
Задание 5.2a

Всё, как в задании 5.2, но, если пользователь ввел адрес хоста, а не адрес сети,
надо преобразовать адрес хоста в адрес сети и вывести адрес сети и маску,
как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.195/28 - хост из сети 10.0.5.192/28

Если пользователь ввел адрес 10.0.1.1/24, вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000


Проверить работу скрипта на разных комбинациях хост/маска, например:
    10.0.5.195/28, 10.0.1.1/24

Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)


Подсказка:
Есть адрес хоста в двоичном формате и маска сети 28. Адрес сети это первые 28 бит
адреса хоста + 4 ноля.
То есть, например, адрес хоста 10.1.1.195/28 в двоичном формате будет
bin_ip = "00001010000000010000000111000011"

А адрес сети будет первых 28 символов из bin_ip + 0000 (4 потому что всего
в адресе может быть 32 бита, а 32 - 28 = 4)
00001010000000010000000111000000

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""
net = input("Введите IP-адрес сети и маску в формате \"10.10.10.0/24\": ")
net_list = list((net.replace(".", " ").replace("/", " ")).split())
mask = int(net_list[4])
arg0 = (bin(int(net_list[0]))).replace("0b", "")
arg1 = (bin(int(net_list[1]))).replace("0b", "")
arg2 = (bin(int(net_list[2]))).replace("0b", "")
arg3 = (bin(int(net_list[3]))).replace("0b", "")
mask_bin = "1"*mask + "0"*(32 - mask)
mask_bin0 = int(mask_bin[0:8], 2)
mask_bin1 = int(mask_bin[8:16], 2)
mask_bin2 = int(mask_bin[16:24], 2)
mask_bin3 = int(mask_bin[24:], 2)

ip_bin = "0"*(8 - len(arg0)) + arg0 + "0"*(8 - len(arg1)) + arg1 + "0"*(8 - len(arg2)) + arg2 + "0"*(8 - len(arg3)) + arg3
ip_net = ip_bin[0:(mask + 1)] + "0"*(32 - mask)
ip_net0 = int(ip_net[0:8], 2)
ip_net1 = int(ip_net[8:16], 2)
ip_net2 = int(ip_net[16:24], 2)
ip_net3 = int(ip_net[24:32], 2)

template = f"""
Network:
{ip_net0:<10}{ip_net1:<10}{ip_net2:<10}{ip_net3:<10}
{ip_net0:08b}  {ip_net1:08b}  {ip_net2:08b}  {ip_net3:08b}

Mask:
/{mask}
{mask_bin0:<10}{mask_bin1:<10}{mask_bin2:<10}{mask_bin3:<10}
{mask_bin0:08b}  {mask_bin1:08b}  {mask_bin2:08b}  {mask_bin3:08b}
"""
print(template)
